app/views/todos/index.html.erb

SELECT "todos".* FROM "todos"
SELECT COUNT(*) FROM "todos"
---
<% end %><br>
<% unless Todo.count.zero? %>