app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First Todo"], ["description", "Hello"], ["created_at", "2022-08-30 23:47:14.569674"], ["updated_at", "2022-08-30 23:47:14.569674"]]
---
    def create
        @todo = Todo.new(todo_params)

        if @todo.save!

UPDATE "todos" SET "description" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["description", "HELLOoooo"], ["updated_at", "2022-08-30 23:54:07.634758"], ["id", 1]]
---
    def update
        if @todo.update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."status" = ?  [["status", "completed"]]
---
    def delete_completed
        Todo.where(status: 1).destroy_all